GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
/*
   I2C的Master 通知 Slave 正常回复
 */
static void I2C_Ack( void )
{
	SCL_L;
	I2C_delay( );
	SDA_L;
	I2C_delay( );
	SCL_H;
	I2C_delay( );
	SCL_L;
	I2C_delay( );
}

/*
   I2C的Master 通知 Slave 停止发送
 */
static void I2C_NoAck( void )
{
	SCL_L;
	I2C_delay( );
	SDA_H;
	I2C_delay( );
	SCL_H;
	I2C_delay( );
	SCL_L;
	I2C_delay( );
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t I2C_WaitAck( void )   //返回为:=1有ACK,=0无ACK
{
	SCL_L;
	I2C_delay( );
	SDA_H;
	I2C_delay( );
	SCL_H;
	I2C_delay( );
	if( SDA_read )
	{
		SCL_L;
		I2C_delay( );
		return ERR_WAITACK;
	}
	SCL_L;
	I2C_delay( );
	return ERR_NONE;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static void I2C_SendByte( u8 SendByte ) //数据从高位到低位//
{
	uint8_t i = 8;
	while( i-- )
	{
		SCL_L;
		I2C_delay( );
		if( SendByte & 0x80 )
		{
			SDA_H;
		} else
		{
			SDA_L;
		}
		SendByte <<= 1;
		I2C_delay( );
		SCL_H;
		I2C_delay( );
	}
	SCL_L;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t I2C_ReceiveByte( void )  //数据从高位到低位//
{
	uint8_t i			= 8;
	uint8_t ReceiveByte = 0;

	SDA_H;
	while( i-- )
	{
		ReceiveByte <<= 1;
		SCL_L;
		I2C_delay( );
		SCL_H;
		I2C_delay( );
		if( SDA_read )
		{
			ReceiveByte |= 0x01;
		}
	}
	SCL_L;
	return ReceiveByte;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t IIC_RegWrite( uint8_t address, uint8_t reg, uint8_t val )
{
	uint8_t err = ERR_NONE;
	err = I2C_Start( );
	if( err )
	{
		goto lbl_ERR_REG_WR;
	}
	I2C_SendByte( MMA845X_ADDR << 1 );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_WR_STOP;
	}

	I2C_SendByte( reg );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_WR_STOP;
	}

	I2C_SendByte( val );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_WR_STOP;
	}
	I2C_Stop( );
	//todo:这里需要延时5ms吗?
	return ERR_NONE;

lbl_ERR_REG_WR_STOP:
	I2C_Stop( );
lbl_ERR_REG_WR:
	rt_kprintf( "reg_wr error=%02x reg=%02x value=%02x\r\n", err, reg, val );
	return err;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t IIC_RegRead( uint8_t address, uint8_t reg, uint8_t* value )
{
	uint8_t err = ERR_NONE;

	err = I2C_Start( );
	if( err )
	{
		goto lbl_ERR_REG_RD_STOP;
	}
	I2C_SendByte( address << 1 );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_RD_STOP;
	}

	I2C_SendByte( reg );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_RD_STOP;
	}

	err = I2C_Start( );
	if( err )
	{
		goto lbl_ERR_REG_RD;
	}

	I2C_SendByte( ( address << 1 ) | 0x01 );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_ERR_REG_RD_STOP;
	}

	*value = I2C_ReceiveByte( );
	I2C_NoAck( );
	I2C_Stop( );
	return ERR_NONE;

lbl_ERR_REG_RD_STOP:
	I2C_Stop( );
lbl_ERR_REG_RD:
	printf( "reg_rd error=%02x reg=%02x\r\n", err, reg );
	return err;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t IIC_RegRead_Data( uint8_t reg, uint8_t *pdata, uint8_t count )
{
	uint8_t err				= ERR_NONE;
	uint8_t NumBytesToRead	= count;
	uint8_t * pBuffer		= pdata;

	err = I2C_Start( );
	if( err )
	{
		goto lbl_IIC_RegRead_Data_err;
	}
	I2C_SendByte( MMA845X_ADDR << 1 );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_IIC_RegRead_Data_err_stop;
	}

	I2C_SendByte( reg );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_IIC_RegRead_Data_err_stop;
	}

	err = I2C_Start( );
	if( err )
	{
		goto lbl_IIC_RegRead_Data_err;
	}

	I2C_SendByte( ( MMA845X_ADDR << 1 ) | 0x01 );
	err = I2C_WaitAck( );
	if( err )
	{
		goto lbl_IIC_RegRead_Data_err_stop;
	}

	while( NumBytesToRead )
	{
		*pBuffer = I2C_ReceiveByte( );
		if( NumBytesToRead == 1 )
		{
			I2C_NoAck( );
		} else
		{
			I2C_Ack( );
		}
		pBuffer++;
		NumBytesToRead--;
	}
	I2C_Stop( );
	return ERR_NONE;
lbl_IIC_RegRead_Data_err_stop:
	I2C_Stop( );
lbl_IIC_RegRead_Data_err:
	return err;
}

/*
   利用systick定时查询，打印中使用了systick的查询方式
 */

volatile uint32_t	ticks = 0;

uint32_t			lastsend_rotation_ticks = 0;
uint32_t			lastsend_crash_ticks	= 0;
uint8_t				last_plstatus			= 0;

uint16_t			last_g_value = 0;

uint16_t			param_mma8451_word1 = 0x8000;
uint16_t			param_mma8451_word2 = 0x1E02; /*0x1e:单位4ms的倍数  0x02:碰撞加速度门限 0.1g的倍数*/

