GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
/*

   传感器处理线程
   原先为函数方式，现在采用线程，使用状态机
 */

#define MMA8451_CONFIG	1
#define MMA8451_TILT	2   /*倾斜检测*/
#define MMA8451_TAP		3   /*震动检测*/

ALIGN( RT_ALIGN_SIZE )
static char thread_sensor_stack[512];
struct rt_thread thread_sensor;


/***********************************************************
***********************************************************/
static void rt_thread_entry_sensor( void* parameter )
{
	uint8_t		int_source, pl;
	uint16_t	res;
	uint8_t		status = MMA8451_CONFIG;
	while( 1 )
	{
		if( ( param_mma8451_word1 & 0x8000 ) == 0x0 )
		{
			continue;
		}
		switch( status )
		{
			case MMA8451_CONFIG:
				res = mma8451_config( param_mma8451_word1, param_mma8451_word2 );
				if( res == 0 )
				{
					status = MMA8451_TILT;
				}
				break;
			case MMA8451_TILT:
				res = IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &int_source );
				if( res )
				{
					status = MMA8451_CONFIG;
					break;;
				}

				if( ( int_source & 0x10 ) == 0x10 )
				{
					res = IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &pl );
					if( res )
					{
						status = MMA8451_CONFIG;
						break;;
					}

					if( ( sensor_info[0] & 0x40 ) == 0x40 ) //首次使用,不发送
					{
						if( ( rt_tick_get( ) - lastsend_rotation_ticks ) > 1000 )
						{
							rt_kprintf( "\r\n%d>pl=%02x", rt_tick_get( ), pl );
							if( pl != last_plstatus )
							{
								//uart2_send_frame( '2', 2, sensor_info, 1 );
								last_plstatus = pl;
							}
							lastsend_rotation_ticks = rt_tick_get( );
						}
					}else
					{
						rt_kprintf( "\r\n%d>First pl=%02x", rt_tick_get( ), pl );
					}
					sensor_info[0] |= 0x40;
				}
				break;

			case MMA8451_TAP:
				res = IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &int_source );
				if( res )
				{
					status = MMA8451_CONFIG;
					break;;
				}

				if( int_source >= 0x80 )
				{
					if( ( rt_tick_get( ) - lastsend_crash_ticks ) > 1000 )
					{
						sensor_info[0] |= 0x80;
						//uart2_send_frame( '2', 2, sensor_info, 1 );
						lastsend_crash_ticks = rt_tick_get( );
					}
					rt_kprintf( "\r\n%d>PULSE_SRC_REG=%02x", rt_tick_get( ), int_source );
				}
				break;
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 50 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void mma8451_driver_init( void )
{

	rt_thread_init( &thread_sensor,
	                "sensor",
	                rt_thread_entry_sensor,
	                RT_NULL,
	                &thread_sensor_stack[0],
	                sizeof( thread_sensor_stack ), 22, 5 );
	rt_thread_startup( &thread_sensor );

	dev_mma8451.type		= RT_Device_Class_Char;
	dev_mma8451.init		= mma8451_init;
	dev_mma8451.open		= mma8451_open;
	dev_mma8451.close		= mma8451_close;
	dev_mma8451.read		= mma8451_read;
	dev_mma8451.write		= mma8451_write;
	dev_mma8451.control		= mma8451_control;
	dev_mma8451.user_data	= RT_NULL;

	rt_device_register( &dev_mma8451, "sensor", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_mma8451 );
}

/************************************** The End Of File **************************************/
